

Lesson 3


Задача 23

Напишите программу, которая принимает на вход число (N) и выдает 
таблицу кубов чисел от 1 до N.


Console.WriteLine("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine());
for (int i = 1; i <= N; i++)
   Console.WriteLine(Math.Pow(i, 3));




Задача 21

Напишите программу, которая принимает на вход координаты двух точек и находит
расстояние между ними в 3D пространстве.

Console.WriteLine("Введите X первой точки: ");
int X1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите Y первой точки: ");
int Y1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите Z первой точки: ");
int Z1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите X второй точки: ");
int X2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите Y второй точки: ");
int Y2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите Z второй точки: ");
int Z2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(Math.Round(Math.Sqrt(Math.Pow((X2 - X1), 2) + Math.Pow((Y2 - Y1), 2) + Math.Pow((Z2 - Z1), 2)),2));




Задача 19

Напишите программу, которая на вход принимает пятизначное 
число и проверяет, является ли оно  палиндромом.



int num,r,sum=0,t;
Console.Write("Введите пятизначное число: ");
num = Convert.ToInt32(Console.ReadLine());
if(num>9999 && num<100000)
{
for(t=num;num!=0;num=num/10)
{
r=num % 10;
sum=sum*10+r;
}
if(t==sum)
Console.Write($"{t} является палиндромом. ");
else
Console.Write($"{t} не является палиндромом.");
}

